<h1 align="center">Pandas</h1>

In [1]:
import pandas as pd
import numpy as np

## Creating a DataFrame

**Create a DataFrame** from a dictionary

In [2]:
X = {'col1': [1, 2], 
     'col2': [3, 4], 
     'col3': ["A", "B"]}

df = pd.DataFrame(data=X)
print(df)

   col1  col2 col3
0     1     3    A
1     2     4    B

**Create a DataFrame** from a 2d array list ofÂ lists

In [3]:
X = [[1, 2, "A"], 
     [3, 4, "B"]]
column_names = ["col1", "col2", "col3"]

df = pd.DataFrame(data = X, columns = column_names)
print(df)

   col1  col2 col3
0     1     2    A
1     3     4    B

**Create a DataFrame** with user defined index values

In [4]:
X = [[6, 5,  10],
     [5, 8,  6], 
     [3, 10, 4]]
column_names = ["Maths", "Science", "English"]
index_vlues = ["John", "Mark", "Peter"]

df = pd.DataFrame(data = X, columns = column_names, index = index_vlues)
print(df)

       Maths  Science  English
John       6        5       10
Mark       5        8        6
Peter      3       10        4

In [5]:
df = pd.read_csv('grades.csv')
df

  Unnamed: 0  Maths  Science  English Class
0       John      6        5       10    H1
1       Mark      5        8        6    H1
2      Peter      3       10        4    H2

In [6]:
df = pd.read_csv('grades.csv',index_col=0)
df

       Maths  Science  English Class
John       6        5       10    H1
Mark       5        8        6    H1
Peter      3       10        4    H2

Access a row by its index

In [7]:
df.loc[["John"]]

      Maths  Science  English Class
John      6        5       10    H1

In [8]:
df[["Maths", "English"]].loc[["Mark"]]

      Maths  English
Mark      5        6

Access a row by its location

In [9]:
df[["Maths", "English"]].iloc[1]

Maths      5
English    6
Name: Mark, dtype: int64

Saving a dataframe to a (csv) file

In [10]:
df.to_csv('grades_copy.csv')

## Inspecting a DataFrame

**Load a csv file into a DataFrame** (London 2017 weather)

In [11]:
LondonWeather = pd.read_csv("WeatherDataLondon2017.csv")

Verify its type

In [12]:
type(LondonWeather)

pandas.core.frame.DataFrame

Print its content

In [13]:
print(LondonWeather)

         date  temperature  wind weather at noon
0    1/1/2017           -2     6            Snow
1    1/2/2017            6     7           Sunny
2    1/3/2017            8    12            Rain
3    1/4/2017           13     7           Sunny
4    1/5/2017           17     6            Rain
5    1/6/2017           20     7           Sunny
6    1/7/2017           28    12            Rain
7    1/8/2017           33     7           Sunny
8    1/9/2017           22     6            Rain
9   1/10/2017           16     7           Sunny
10  1/11/2017            8    12            Rain
11  1/12/2017           -3     7            Snow

Pandas' display

In [14]:
LondonWeather

         date  temperature  wind weather at noon
0    1/1/2017           -2     6            Snow
1    1/2/2017            6     7           Sunny
2    1/3/2017            8    12            Rain
3    1/4/2017           13     7           Sunny
4    1/5/2017           17     6            Rain
5    1/6/2017           20     7           Sunny
6    1/7/2017           28    12            Rain
7    1/8/2017           33     7           Sunny
8    1/9/2017           22     6            Rain
9   1/10/2017           16     7           Sunny
10  1/11/2017            8    12            Rain
11  1/12/2017           -3     7            Snow

Print top N rows

In [15]:
LondonWeather.head()

       date  temperature  wind weather at noon
0  1/1/2017           -2     6            Snow
1  1/2/2017            6     7           Sunny
2  1/3/2017            8    12            Rain
3  1/4/2017           13     7           Sunny
4  1/5/2017           17     6            Rain

In [16]:
LondonWeather.head(7)

       date  temperature  wind weather at noon
0  1/1/2017           -2     6            Snow
1  1/2/2017            6     7           Sunny
2  1/3/2017            8    12            Rain
3  1/4/2017           13     7           Sunny
4  1/5/2017           17     6            Rain
5  1/6/2017           20     7           Sunny
6  1/7/2017           28    12            Rain

Print last N rows

In [17]:
LondonWeather.tail()

         date  temperature  wind weather at noon
7    1/8/2017           33     7           Sunny
8    1/9/2017           22     6            Rain
9   1/10/2017           16     7           Sunny
10  1/11/2017            8    12            Rain
11  1/12/2017           -3     7            Snow

In [18]:
LondonWeather.tail(3)

         date  temperature  wind weather at noon
9   1/10/2017           16     7           Sunny
10  1/11/2017            8    12            Rain
11  1/12/2017           -3     7            Snow

Check DataFrame's shape

In [19]:
LondonWeather.shape

(12, 4)

Check columns' datatype

In [20]:
LondonWeather.dtypes

date               object
temperature         int64
wind                int64
weather at noon    object
dtype: object

Print some information about the DataFrame

In [21]:
LondonWeather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             12 non-null     object
 1   temperature      12 non-null     int64
 2   wind             12 non-null     int64
 3   weather at noon  12 non-null     object
dtypes: int64(2), object(2)
memory usage: 512.0+ bytes

Print some descriptive statistics about the DataFrame

In [22]:
LondonWeather.describe()

       temperature      wind
count    12.000000  12.00000
mean     13.833333   8.00000
std      11.085070   2.44949
min      -3.000000   6.00000
25%       7.500000   6.75000
50%      14.500000   7.00000
75%      20.500000   8.25000
max      33.000000  12.00000

NOTE: accessing specific columns can return DataFrame/Series

In [23]:
LondonWeather[['date']]

         date
0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
6    1/7/2017
7    1/8/2017
8    1/9/2017
9   1/10/2017
10  1/11/2017
11  1/12/2017

In [24]:
type(LondonWeather[['date']])

pandas.core.frame.DataFrame

In [25]:
LondonWeather['date']

0      1/1/2017
1      1/2/2017
2      1/3/2017
3      1/4/2017
4      1/5/2017
5      1/6/2017
6      1/7/2017
7      1/8/2017
8      1/9/2017
9     1/10/2017
10    1/11/2017
11    1/12/2017
Name: date, dtype: object

In [26]:
type(LondonWeather['date'])

pandas.core.series.Series

## Manipulating a DataFrame

Dealing with nans

In [27]:
X = {'col1': [1, 2, 3, 4, 5, 6], 
     'col2': [.1, .2, np.nan, .4, .5, .6], 
     'col3': ["A", "B", "C", "D", "E", "F"]}

df = pd.DataFrame(data=X)
df

   col1  col2 col3
0     1   0.1    A
1     2   0.2    B
2     3   NaN    C
3     4   0.4    D
4     5   0.5    E
5     6   0.6    F

Replace nans with a specific value

In [28]:
df.fillna(0, inplace = True)
df

   col1  col2 col3
0     1   0.1    A
1     2   0.2    B
2     3   0.0    C
3     4   0.4    D
4     5   0.5    E
5     6   0.6    F

Dropping nans

In [29]:
df = pd.DataFrame(data=X)
df

   col1  col2 col3
0     1   0.1    A
1     2   0.2    B
2     3   NaN    C
3     4   0.4    D
4     5   0.5    E
5     6   0.6    F

In [30]:
df.dropna(inplace=True)
df

   col1  col2 col3
0     1   0.1    A
1     2   0.2    B
3     4   0.4    D
4     5   0.5    E
5     6   0.6    F

Renaming a Column

In [31]:
df = pd.DataFrame(data=X)
df

   col1  col2 col3
0     1   0.1    A
1     2   0.2    B
2     3   NaN    C
3     4   0.4    D
4     5   0.5    E
5     6   0.6    F

In [32]:
df.rename(columns = {"col1":"new_col1"},inplace=True)
df

   new_col1  col2 col3
0         1   0.1    A
1         2   0.2    B
2         3   NaN    C
3         4   0.4    D
4         5   0.5    E
5         6   0.6    F

Removing a column from a dataframe

In [33]:
df.drop(columns = ["col2"], inplace = True)

In [34]:
df

   new_col1 col3
0         1    A
1         2    B
2         3    C
3         4    D
4         5    E
5         6    F

Adding a new column

In [36]:
X = {'col1': [1, 2, 3, 4, 5, 6], 
     'col2': [.1, .2, np.nan, .4, .5, .6]}

In [37]:
df = pd.DataFrame(data=X)
df

   col1  col2
0     1   0.1
1     2   0.2
2     3   NaN
3     4   0.4
4     5   0.5
5     6   0.6

In [38]:
df[["col3"]] = df["col1"] + df["col2"]
df

   col1  col2  col3
0     1   0.1   1.1
1     2   0.2   2.2
2     3   NaN   NaN
3     4   0.4   4.4
4     5   0.5   5.5
5     6   0.6   6.6

Handling Duplicates

In [39]:
df = pd.DataFrame([[1, "A"], 
                   [2, "B"], 
                   [1, "A"], 
                   [1, "A"]], 
                  columns = ["col1", "col2"])
                  
df

   col1 col2
0     1    A
1     2    B
2     1    A
3     1    A

In [40]:
df.duplicated()

0    False
1    False
2     True
3     True
dtype: bool

In [43]:
df.drop_duplicates(inplace=True)

In [44]:
df

   col1 col2
0     1    A
1     2    B

In [45]:
df = pd.DataFrame([[6, 5,  10], 
                   [5, 8,  6], 
                   [3, 10, 4]], 
                  columns = ["col1", "col2", "col3"],
                  index = [2, 3, 1])

df

   col1  col2  col3
2     6     5    10
3     5     8     6
1     3    10     4

Applying a function to a column in a DataFrame

In [46]:
def square_col(num):
    return num**2
df["col3"] = df['col1'].apply(square_col)
df

   col1  col2  col3
2     6     5    36
3     5     8    25
1     3    10     9

Sorting a DataFrame

In [47]:
X = {'col1': [1, 2, 2, 1, 5, 1, 3], 
     'col2': [.6, -.2, 5, -11.4, 9.7, 0, 1]}

In [48]:
df = pd.DataFrame(data=X)
df

   col1  col2
0     1   0.6
1     2  -0.2
2     2   5.0
3     1 -11.4
4     5   9.7
5     1   0.0
6     3   1.0

In [50]:
df.sort_values("col2",inplace = True)
df

   col1  col2
3     1 -11.4
1     2  -0.2
5     1   0.0
0     1   0.6
6     3   1.0
2     2   5.0
4     5   9.7

## Finding some values of interest in a DataFrame

Finding min/max/mean/median values in a DataFrame

In [51]:
df.max()

col1    5.0
col2    9.7
dtype: float64

In [52]:
df.min()

col1     1.0
col2   -11.4
dtype: float64

In [53]:
df.mean()

col1    2.142857
col2    0.671429
dtype: float64

In [54]:
df["col1"].max()

5

In [55]:
df["col1"].min()

1

In [56]:
df["col1"].mean()

2.142857142857143

In [57]:
df["col2"].median()

0.6

Finding the unique values in a column of a DataFrame

In [58]:
df["col1"].unique()

array([1, 2, 3, 5], dtype=int64)

Finding the number of the unique values in a column of a DataFrame

In [59]:
df["col1"].nunique()

4

Finding the frequency ofÂ of all values in a column of a DataFrame

In [60]:
df["col1"].value_counts()

1    3
2    2
3    1
5    1
Name: col1, dtype: int64

Manipulating the index

In [61]:
df = pd.read_csv('grades.csv',index_col=0)
df

       Maths  Science  English Class
John       6        5       10    H1
Mark       5        8        6    H1
Peter      3       10        4    H2

In [62]:
df.index

Index(['John', 'Mark', 'Peter'], dtype='object')

In [63]:
df.reset_index(inplace=True)

In [64]:
df

   index  Maths  Science  English Class
0   John      6        5       10    H1
1   Mark      5        8        6    H1
2  Peter      3       10        4    H2

In [65]:
df = pd.read_csv('grades.csv',index_col=0)
df

       Maths  Science  English Class
John       6        5       10    H1
Mark       5        8        6    H1
Peter      3       10        4    H2

In [66]:
df.reset_index(drop=True,inplace=True)
df

   Maths  Science  English Class
0      6        5       10    H1
1      5        8        6    H1
2      3       10        4    H2

In [67]:
df.set_index('Class',inplace=True)
df

       Maths  Science  English
Class
H1         6        5       10
H1         5        8        6
H2         3       10        4